In [1]:
# to make the .py script runnable
#!/usr/bin/env python

In [2]:
from sklearn import datasets
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline
plt.style.use('ggplot')

In [1]:
import os

# 2.3 Importing data and import/read from and export/ dump to SQL (done)

## 2.3.1 CSV Files

Reading a CSV is as simple as calling the read_csv function. By default, the `read_csv` function expects the column separator to be a comma, but you can change that using the sep parameter.

Syntax: `pd.read_csv(filepath, sep=, header=, names=, skiprows=, na_values= ... )`

The example used in this section is a dataframe, an object inherent to pandas. We will take an in depth look at dataframes in the next section.

### 2.3.1.1 Inspect file without importing it

In [4]:
!wc -l data/titanic.csv

     892 data/titanic.csv

In [5]:
!head -5 data/titanic.csv #note the difference between the first line and the other lines

In [6]:
!tail -5 data/titanic.csv

In [7]:
lines = !head -5 data/titanic.csv #note the difference between the first line and the other lines

In [8]:
print(lines)

['PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked', '1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,,S', '2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38,1,0,PC 17599,71.2833,C85,C', '3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,,S', '4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S']

### 2.3.1.2 Importing a CSV file

In [9]:
df_titanic = pd.read_csv('data/titanic.csv')

In [10]:
type(df_titanic)

pandas.core.frame.DataFrame

In [11]:
df_titanic.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [12]:
df_titanic.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

## 2.3.2 Support for SQL Databases

Pandas also has some support for reading/writing DataFrames directly from/to a database. 

You'll typically just need to pass a connection object to the `read_frame` or `write_frame` functions within the pandas.io module.

***Note*** `write_frame` executes as a series of `INSERT INTO` statements and thus trades speed for simplicity. If you're writing a large DataFrame to a database, it might be quicker to write the DataFrame to CSV and load that directly using the database's file import arguments.

In [13]:
os.getcwd() + '/data'

'/Users/AVNH/0 - Crunch Analytics/Notebooks/data'

In [14]:
os.listdir(os.getcwd() + '/data')

['store_info.csv',
 'towed.db',
 'all_the_misses.csv',
 'titanic.csv',
 'features.csv',
 'historic_sales.csv']

In [15]:
dblist = [x for x in os.listdir(os.getcwd() + '/data') if '.db' in x]

for db in dblist:
    print(db)

towed.db

In [ ]:
help(pd.read_sql) #Delete the '#' to see some extra info

In [16]:
from pandas.io import sql
import sqlite3 

conn = sqlite3.connect('data/towed.db')
query = "SELECT * FROM towed WHERE make = 'FORD';"

results = pd.read_sql(query, con=conn)
print(results.head())

         date  make style model color    plate state             towed_to  \
0  11/18/2014  FORD    LL         BLK  S105053    IL        10300 S. Doty
1  11/18/2014  FORD    LL         WHI  N104269    IL  400 E. Lower Wacker
2  11/18/2014  FORD    2D         WHI  V519776    IL    701 N. Sacramento
3  11/18/2014  FORD    PK    TK   RED             IL    701 N. Sacramento
4  11/18/2014  FORD    4D         GRY             IL    701 N. Sacramento

    facility_phone  inventory_num
0  (773) 568-8495         2750424
1   (312) 744-7550         917123
2   (773) 265-1846        1532925
3   (773) 265-7605        6798362
4   (773) 265-7605        6798317

In [17]:
pd.read_sql("SELECT distinct make, count(*) from towed group by 1 order by 2 desc limit 10", conn)

   make  count(*)
0  CHEV       870
1  FORD       605
2  DODG       386
3  PONT       368
4  TOYT       292
5  BUIC       283
6  NISS       273
7  HOND       251
8  CHRY       195
9  OLDS       144

In [19]:
from pandas.io import sql
import sqlite3 

conn = sqlite3.connect('data/towed.db')

#use to_sql instead of write_frame
df_titanic.to_sql("tbTitanic", con=conn)

In [20]:
from pandas.io import sql
import sqlite3 

conn = sqlite3.connect('data/towed.db')
#query = "select * from sqlite_master where type = 'table';"
query = "SELECT * FROM tbTitanic;"

df_titanic2 = pd.read_sql(query, con=conn)
print(df_titanic2.head())

   index  PassengerId  Survived  Pclass  \
0      0            1         0       3
1      1            2         1       1
2      2            3         1       3
3      3            4         1       1
4      4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500  None        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250  None        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500  None        S

In [21]:
#dump one table

import sqlite3
import pandas as pd

db = sqlite3.connect('data/towed.db')
table = pd.read_sql_query("SELECT * from towed", db)
#table.to_csv(table_name + '.csv', index_label='index')
print(table)

            date  make style model color     plate state             towed_to  \
0     11/18/2014  FORD    LL         BLK   S105053    IL        10300 S. Doty
1     11/18/2014  HOND    4D   ACC   BLK   S415270    IL  400 E. Lower Wacker
2     11/18/2014  CHRY    VN         SIL   V847641    IL    701 N. Sacramento
3     11/18/2014  HYUN    4D         SIL   N756530    IL  400 E. Lower Wacker
4     11/18/2014  TOYT    4D         WHI   K702211    IL  400 E. Lower Wacker
5     11/18/2014  PONT    VN    TK   TAN   V415912    IL    701 N. Sacramento
6     11/18/2014  JEEP    LL    TK   RED   717R342    IL    701 N. Sacramento
7     11/18/2014  CHEV    4D         BLK   E255028    IL  400 E. Lower Wacker
8     11/18/2014  SUBA    4D         SIL   FOA2720    OH  400 E. Lower Wacker
9     11/18/2014  VOLK    2D         BLK   R775959    IL  400 E. Lower Wacker
10    11/18/2014  MERZ    4D         BLK   S796032    IL        10300 S. Doty
11    11/18/2014  BUIC    4D         SIL   V523607    IL        10300 S. Doty
12    11/18/2014  CHEV    2D         RED   787R772    IL        10300 S. Doty
13    11/18/2014  FORD    LL         WHI   N104269    IL  400 E. Lower Wacker
14    11/18/2014  HOND    4D         BLU   V332105    IL    701 N. Sacramento
15    11/18/2014  FORD    2D         WHI   V519776    IL    701 N. Sacramento
16    11/18/2014  PONT    4D         TAN   V415926    IL    701 N. Sacramento
17    11/18/2014  FORD    PK    TK   RED              IL    701 N. Sacramento
18    11/18/2014  TOYT    VN   SNA   BLU   30021TX    IL    701 N. Sacramento
19    11/18/2014  NISS    VN    TK   SIL              IL    701 N. Sacramento
20    11/18/2014   GMC    LL         BLK   R417487    IL    701 N. Sacramento
21    11/18/2014  TOYT    4D         BLK   R599363    IL    701 N. Sacramento
22    11/18/2014  LEXS    4D         BLK   3110153    IL  400 E. Lower Wacker
23    11/18/2014  NISS    4D         GRY   K605011    IL  400 E. Lower Wacker
24    11/18/2014  TOYT    4D         WHI   K638224    IL  400 E. Lower Wacker
25    11/18/2014  CHEV    4D         BLK   V929955    IL  400 E. Lower Wacker
26    11/18/2014  DODG    VN   CVN   DBL   N339079    IL    701 N. Sacramento
27    11/18/2014  JEEP    LL         GRY   R421374    IL    701 N. Sacramento
28    11/18/2014  HYUN    4D         GLD   V391056    IL    701 N. Sacramento
29    11/18/2014  BUIC    4D         WHI   S218814    IL    701 N. Sacramento
...          ...   ...   ...   ...   ...       ...   ...                  ...
5035  08/21/2014  HOND    4D   ACC   GRY   7385169    IL    701 N. Sacramento
5036  08/21/2014   ROV    LL         GRN   L629391    IL    701 N. Sacramento
5037  08/21/2014  FORD    LL    TK   SIL   L301550    IL    701 N. Sacramento
5038  08/21/2014  DODG    4D         RED   N312009    IL    701 N. Sacramento
5039  08/21/2014  TOYT    4D         WHI   S118519    IL    701 N. Sacramento
5040  08/21/2014  LINC    4D   CON   SIL   K386385    IL    701 N. Sacramento
5041  08/21/2014  DODG    VN    TK   TAN   X303991    IL        10300 S. Doty
5042  08/21/2014  DODG    2D         WHI  1354595B    IL        10300 S. Doty
5043  08/21/2014  DODG    LL    TK   WHI   N139158    IL        10300 S. Doty
5044  08/21/2014   KIA    4D         BLK    IBJ943    IN        10300 S. Doty
5045  08/21/2014   GMC    LL    TK   WHI   AD67298    AZ        10300 S. Doty
5046  08/21/2014  CADI    4D   ELD   BLK   321R401    IL        10300 S. Doty
5047  08/21/2014  CHEV    4D   IMP   SIL   379R975    IL    701 N. Sacramento
5048  08/21/2014   GMC    4D   JMY   GRY   V159841    IL        10300 S. Doty
5049  08/21/2014  DODG    4D   CHA   SIL   R841318    IL        10300 S. Doty
5050  08/21/2014   KIA    LL         GRN   P234420    IL        10300 S. Doty
5051  08/21/2014  FORD    VN    TK   WHI   1449768    IL    701 N. Sacramento
5052  08/21/2014  DODG    VN         GRY   600R519    IL    701 N. Sacramento
5053  08/21/2014  CADI    4D         WHI   R956127    IL    701 N. Sacramento
5054  08/21/2014  BUIC    4D         GRY   E987287    IL    701 N. Sacramento
5055  08/21/2014  CHEV    VN    TK   WHI   263R725    IL    701 N. Sacramento
5056  08/21/2014  CHEV    4D         SIL   V589509    IL    701 N. Sacramento
5057  08/21/2014  ACUR    4D         GRY   8797203    IL        10300 S. Doty
5058  08/21/2014  NISS    4D         GRY   R600128    IL        10300 S. Doty
5059  08/21/2014  FORD    LL    TK   BLK   N762179    IL        10300 S. Doty
5060  08/21/2014  HOND    4D         GRY   S189762    IL    701 N. Sacramento
5061  08/20/2014  NISS    2D         GRY   V795149    IL    701 N. Sacramento
5062  08/20/2014  FORD    VN    TK   MAR   V468364    IL    701 N. Sacramento
5063  08/20/2014  LEXS    4D         BLK   P743610    IL        10300 S. Doty
5064  08/20/2014  BUIC    4D         GRY              IL    701 N. Sacramento

       facility_phone  inventory_num
0     (773) 568-8495         2750424
1      (312) 744-7550         917129
2      (773) 265-7605        6798366
3      (312) 744-7550         917127
4      (312) 744-7550         917128
5      (773) 265-7605        6798365
6      (773) 265-7605        6798364
7      (312) 744-7550         917126
8      (312) 744-7550         917125
9      (312) 744-7550         917124
10    (773) 568-8495         2750423
11    (773) 568-8495         2750422
12    (773) 568-8495         2750421
13     (312) 744-7550         917123
14     (773) 265-1846        1532926
15     (773) 265-1846        1532925
16     (773) 265-7605        6798363
17     (773) 265-7605        6798362
18     (773) 265-7605        6798361
19     (773) 265-7605        6798360
20     (773) 265-7605        6798359
21     (773) 265-7605        6798358
22     (312) 744-7550         917121
23     (312) 744-7550         917118
24     (312) 744-7550         917115
25     (312) 744-7550         917112
26     (773) 265-7605        6798357
27     (773) 265-7605        6798356
28     (773) 265-7605        6798355
29     (773) 265-7605        6798354
...               ...            ...
5035   (773) 265-7605        6791179
5036   (773) 265-7605        6791177
5037   (773) 265-7605        6791176
5038   (773) 265-7605        6791205
5039   (773) 265-7605        6791204
5040   (773) 265-7605        6791194
5041  (773) 568-8495         2744163
5042  (773) 568-8495         2744156
5043  (773) 568-8495         2744164
5044  (773) 568-8495         2744179
5045  (773) 568-8495         2744149
5046  (773) 568-8495         2744160
5047   (773) 265-7605        6791175
5048  (773) 568-8495         2744148
5049  (773) 568-8495         2744153
5050  (773) 568-8495         2744151
5051   (773) 265-7605        6791193
5052   (773) 265-7605        6791174
5053   (773) 265-7605        6791170
5054   (773) 265-7605        6791171
5055   (773) 265-7605        6791168
5056   (773) 265-7605        6791167
5057  (773) 568-8495         2744128
5058  (773) 568-8495         2744217
5059  (773) 568-8495         2744213
5060   (773) 265-7605        6791155
5061   (773) 265-7605        6791150
5062   (773) 265-7605        6791149
5063  (773) 568-8495         2744115
5064   (773) 265-7605        6791143

[5065 rows x 10 columns]

In [24]:
#dump all tables

import sqlite3
import pandas as pd

def to_csv():
    db = sqlite3.connect('data/towed.db')
    cursor = db.cursor()
    query = "SELECT name FROM sqlite_master WHERE type='table';"
    cursor.execute(query)
    tables = cursor.fetchall()
    print(tables)
    for table_name in tables:
        print(table_name)
        #table_name = table_name[0]
        sql = "SELECT * from %s LIMIT 3;" % table_name
        print(sql)
        table = pd.read_sql_query(sql, db)
        #table.to_csv(table_name + '.csv', index_label='index')
        print (table.head())
        
to_csv()

[('towed',), ('dbTitanic',), ('tbTitanic',)]
('towed',)
SELECT * from towed LIMIT 3;
         date  make style model color    plate state             towed_to  \
0  11/18/2014  FORD    LL         BLK  S105053    IL        10300 S. Doty
1  11/18/2014  HOND    4D   ACC   BLK  S415270    IL  400 E. Lower Wacker
2  11/18/2014  CHRY    VN         SIL  V847641    IL    701 N. Sacramento

    facility_phone  inventory_num
0  (773) 568-8495         2750424
1   (312) 744-7550         917129
2   (773) 265-7605        6798366
('dbTitanic',)
SELECT * from dbTitanic LIMIT 3;
   index  PassengerId  Survived  Pclass  \
0      0            1         0       3
1      1            2         1       1
2      2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500  None        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250  None        S
('tbTitanic',)
SELECT * from tbTitanic LIMIT 3;
   index  PassengerId  Survived  Pclass  \
0      0            1         0       3
1      1            2         1       1
2      2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500  None        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250  None        S

---

Read: 

1. Homepage http://www.sqlalchemy.org/
2. Engines http://docs.sqlalchemy.org/en/latest/core/engines.html

---

## 2.3.3 Reading from the Clipboard!

This is as straight forward as it ought to be.

Example: `df_2 = pd.read_clipboard(); df_2.head()`

---